Page({
  data: {
    // 初始化省市区数据
    multiArray: [['季节及地区', '始因', '寒热', '汗出', '疼痛', '头身不适感', '睡眠情志', '咳痰喘', '饮食口味', '大便', '小便', '经带精液等', '出血', '声音', '气味', '神志面色', '头面五官体征', '颈胸腹部体征', '形体肌肤体征', '舌象', '脉诊', '按诊', '高尿酸', '子宫肌瘤', '乳腺小叶增生', '脂肪肝', '高血脂', '肥胖'], ['地区','季节'],['1号地区（福建，广东，广西，台湾）','2号地区（黑龙江，吉林，辽宁，河北，北京、天津）', '3号地区（湖南，江西，四川，贵州，重庆、云南）', '4号地区（甘肃，青海，宁夏，陕西，新疆、山西、西藏）']],
    
    multiIndex: [0, 0, 0], // 初始化选择的下标
    selectedItems: [], // 用来存储多次选择的内容
    imageUrl:'',
    objectMultiArray: [
      {one: '季节及地区',
      two: ['地区', '季节'],
      three: [['1号地区（福建，广东，广西，台湾）','2号地区（黑龙江，吉林，辽宁，河北，北京、天津）', '3号地区（湖南，江西，四川，贵州，重庆、云南）', '4号地区（甘肃，青海，宁夏，陕西，新疆、山西、西藏）'], ['春', '夏', '秋', '冬', '长夏']]
      },
      {one: '始因',
      two: ['外感病因', '内伤病因', '其他病因'],
      three: [['新近感受风寒', '感受暑热火邪', '环境潮湿', '环境干燥', '淋雨下水'], ['饮食不慎', '嗜食肥甘厚味', '嗜食辛辣', '过食生冷', '活动或劳累病重', '病情与情志有关'], ['外伤或手术史', '外伤或手术史', '外伤或手术史', '强毒侵害', '不良生活习惯', '不良生活习惯', '缓起久病']]
      },
      {one: '寒热',
      two: ['恶寒发热', '但寒不热', '但热不寒', '往来寒热', '寒热喜恶'],
      three: [['新起微发热', '新起恶寒重', '新起发热重', '微恶风寒', '发热重恶寒轻', '恶寒发热', '寒战'], ['经常恶风', '容易感冒', '经常畏冷', '体温低', '局部寒冷', '局部寒冷', '局部寒冷', '局部寒冷', '局部寒冷', '局部寒冷', '局部寒冷'], ['发热', '壮热', '潮热', '潮热', '潮热', '潮热', '久有低热', '久有低热', '久有低热', '久有低热', '久有低热', '久有低热', '久有低热', '局部灼热感', '局部灼热感', '局部灼热感'], ['局部灼热感'], ['喜凉恶热', '喜温恶凉']]
      },
      {one: '汗出',
      two: ['有汗', '无汗'],
      three: [['新病有汗', '汗多无不适', '暑天汗多', '出虚汗或易出汗', '汗出不彻', '局部汗多', '局部汗多', '局部汗多', '特殊汗出', '特殊汗出', '特殊汗出', '特殊汗出', '特殊汗出', '特殊汗出', '特殊汗出'], ['少汗无汗', '壮热无汗', '新病无汗']]
      },
      {one:' 疼痛',
      two: ['部位', '性质', '加重或缓解特点'],
      three: [['头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '头面部', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '躯体部位', '四肢部位', '四肢部位', '四肢部位', '四肢部位', '四肢部位', '肩颈腰背部', '肩颈腰背部', '肩颈腰背部', '肩颈腰背部', '肩颈腰背部', '肌肉疼痛', '身痛'], ['胀痛或窜痛', '绞痛', '固定痛', '刺痛', '游走痛', '闷痛', '空痛', '灼痛', '冷痛', '酸重痛', '隐痛', '转移痛', '转筋挛痛', '牵掣痛'], ['食热痛甚', '食热痛缓、食冷痛剧', '进食痛甚', '得食痛缓', '活动加剧', '活动痛缓；不动痛甚', '夜间痛甚', '气行觉舒', '阴雨天疼痛加重']]
      },
      {one: '头身不适感',
      two: ['头面部', '躯干部'],
      three: [['鼻痒', '口舌发麻', '头蒙如裹', '头晕', '头胀及胀痛', '眼胀及胀痛', '头重', '眼花', '视歧', '眼干涩', '视物模糊', '畏光', '暴盲', '眼眵多', '脑鸣', '耳暴鸣', '耳久鸣', '新病失聪(聋)', '长期失聪(聋)', '鼻塞流清涕', '流浊涕', '喉痒', '咽部异物感', '气梗堵感', '头重脚轻感'], ['背胀', '肛门瘙痒', '阴部瘙痒', '肢体肌肤麻木', '项背拘急', '腰膝酸软', '气上冲感', '气下坠感', '小腹胀', '腹胀', '胃脘嘈杂', '脘痞胀', '胁胀', '胸闷', '怔忡', '心慌', '惊悸', '乳房痒', '乳房胀', '心悸', '身体酸(困)重', '皮肤瘙痒', '倦怠乏力', '筋惕肉瞤']]
      },
      {one: '睡眠情志',
      two: ['睡眠', '情志'],
      three: [['神疲动则益甚', '失眠', '多梦', '睡眠不实', '嗜睡', '神疲动后稍舒'], ['恐惧、幻觉、多疑、强迫', '情绪易激动', '喜叹气', '善悲易哭', '心烦', '烦躁', '急躁易怒', '胆怯易惊', '情志抑郁或忧虑、孤僻', '懒言', '健忘']]
      },
      {one: '咳痰喘',
      two: ['咳嗽', '吐痰', '气喘'],
      three: [['新病咳嗽', '阵发呛咳', '干咳', '咳嗽', '新病干咳'], ['痰多质稠', '痰少质稠', '痰黏难咳', '痰多质稀', '痰少质稀', '新病痰少质稀', '泡沫痰多', '铁锈色痰', '痰色白', '新病痰色白', '痰色绿', '痰色黄', '腥臭痰', '脓性痰', '痰中带血', '痰滑易咳', '吐痰', '喉中哮鸣声'], ['久病气喘', '新病气喘', '喘不能卧', '气喘', '气短']]
      },
      {one: '饮食口味',
      two: ['口味', '口渴与饮水', '食欲及食量'],
      three: [['口苦', '口淡', '口甜', '口咸', '口黏腻', '口酸'], ['口不渴', '口渴', '渴欲饮冷', '渴欲饮热', '渴不欲饮', '咽干', '新病咽干', '新病无热而饮多', '无热而饮多'], ['吞食梗塞', '嗜食异物', '厌油腻', '多食易饥', '饥不欲食', '食后痞胀', '纳呆恶食', '新病食少', '久不欲食', '长期食少', '进食无味']]
      },
      {one: '大便',
      two: ['便次异常', '便色质异常', '排便异常', '矢气'],
      three: [['新起腹泻', '经常腹泻', '五更腹泻', '新病便秘', '经常便秘', '大便干结', '经常便溏', '新起便稀'], ['大便排虫', '大便细扁', '完谷不化', '大便腥腐臭气', '大便黑如柏油', '大便色灰白', '大便时溏时结', '大便先干后稀', '大便有脓血/如鱼脑', '大便有黏液', '大便如黄糜', '大便如水样/米泔水样', '大便如蛋汤'], ['腹痛欲泻', '大便失禁', '里急后重', '排便困难', '肛门坠胀', '肛门灼热', '排便不爽', '排便无力', '泻势急迫'], ['矢气多', '矢气无', '矢气甚臭']]
      },
      {one: '小便',
      two: ['便次异常', '便量色质异常', '排便异常'],
      three: [['尿潴留', '新病尿频', '长期尿频', '夜尿多'], ['小便浑浊/如脂膏', '小便特多', '尿黄褐', '尿少', '尿短黄', '尿清长'], ['尿后滴浊液', '尿路砂石', '小便失禁', '余尿不尽', '遗尿', '新起小便淋漓', '排尿涩痛', '排尿灼热', '排尿无力']]
      },
      {one: '经带精液等',
      two: ['男', '女'],
      three: [['遗精', '滑精', '阳痿', '早泄', '性欲衰退', '阳强易举', '精液稀少/畸形', '精液清冷', '不育'], ['经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '经', '带', '带', '带', '带', '带', '胎产', '胎产', '胎产']]
      },
      {one: '出血',
      two: ['色', '部位', '性质'],
      three: [['出血色黯成块', '出血色深红', '出血色鲜红', '出血浅淡'], ['头面五官', '头面五官', '头面五官', '头面五官', '二阴', '二阴', '二阴', '二阴', '二阴', '皮肤', '皮肤', '乳衄', '呕血', '咳血'], ['急性出血', '慢性出血', '血中夹不消化食物']]
      },
      {one:' 声音',
      two: ['发声', '语言', '呼吸', '咳嗽', '呕吐', '嗳气', '胃肠部', '呃逆', '喷嚏', '关节内作响', '喜呵欠', '夜啼', '睡中磨牙'],
      three: [['声低', '声音洪亮', '新病失声', '久病失声', '声音重浊'], ['谵语', '郑声', '语言不利'], ['鼾声不止/酣睡', '气息微弱'], ['喉中痰鸣、痰壅'], ['恶心', '呕吐', '干呕', '呕吐酸水', '呕吐苦水', '呕吐清水', '呕吐痰涎', '呕吐馊食或宿食', '呕吐蛔虫', '吐粪样物'], ['嗳气', '嗳气酸馊'], ['肠鸣漉漉', '肠鸣亢进', '肠鸣减弱', '肠鸣消失', '胃部振水音'], ['胃部振水音'], ['胃部振水音'], ['胃部振水音'], ['胃部振水音'], ['胃部振水音'], ['胃部振水音']]
      },
      {one:'气味',
      two: ['口臭'],
      three: [['胃部振水音']]
      },
      {one: '神志面色',
      two: ['神志', '面色'],
      three: [['神志恍惚', '神昏', '渐入昏迷', '晕倒', '突然昏仆', '躁扰不宁', '神志错乱', '神志狂乱', '神志痴呆', '昏迷吐涎沫', '口角流涎', '神情淡漠', '智力低下'], ['面色少华', '面色萎黄', '面黄如橘', '面黄色黯', '面色晦黯', '面色淡白', '面色苍白', '面色晄白', '面色黧黑', '面色赤', '颧红', '面红如妆', '颧颊紫红']]
      },
      {one: '头面五官体征',
      two: ['耳鼻喉口唇', '目', '头面发'],
      three: [['耳肿流脓', '耳轮干枯', '鼻翼煽动', '鼻唇干燥', '唇淡', '唇红', '唇紫', '口唇溃烂', '口眼\ue81f斜', '口腔白屑', '口腔赤烂', '口腔糜烂', '牙龈溃烂', '牙齿焦黑', '牙龈萎缩', '牙齿松动', '牙龈红肿', '牙关紧闭', '咽喉红肿', '咽喉嫩红不肿', '咽喉肿不红', '咽喉赤烂', '咽喉白膜'], ['眼睑淡白', '眼睑下垂', '眼窝凹陷', '眼周黯黑', '眼突', '直视上窜', '目黄', '目赤无所苦', '目赤睑肿', '巩膜紫斑', '睡后露睛', '瞳神散大或缩小'], ['头颅增大', '囟门未闭', '囟门突起', '囟门凹陷', '面睑浮肿', '发枯憔悴/结穗', '发白易脱', '枕部脱发']]
      },
      {one: '颈胸腹部体征',
      two: ['颈部', '胸部', '腹部', '二阴'],
      three: [['颈脉怒张', '瘿瘤'], ['少乳或无乳汁'], ['腹露青筋', '腹膨隆', '腹硬满', '舟状腹'], ['子宫下垂', '脱肛', '内脏下垂', '痔疮', '阴部湿疹', '阴囊或睾丸肿', '阴部潮湿/湿烂', '外阴干燥', '阴器收缩', '阴部坠胀']]
      },
      {one: '形体肌肤体征',
      two: ['形体', '水肿', '皮肤', '爪甲'],
      three: [['小儿生长发育迟缓', '关节', '关节', '关节', '关节', '关节', '动静姿态', '动静姿态', '动静姿态', '动静姿态', '异常动作', '异常动作', '异常动作', '异常动作', '异常动作', '异常动作', '异常动作', '异常动作', '异常动作', '异常动作', '肢体', '肢体', '肢体', '肢体', '肢体'], ['水肿', '反复水肿', '新起水肿', '局限性水肿'], ['色泽异常', '色泽异常', '色泽异常', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症', '皮肤病症'], ['皮肤病症', '指端青紫', '指甲淡白']]
      },
      {one: '舌象',
      two: ['舌质', '舌苔', '舌下络脉曲张'],
      three: [['肝掌', '舌白如镜', '舌红如镜', '舌体溃烂', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '色', '形', '形', '形', '形', '形', '形', '形', '态', '态', '态', '态'], ['态', '质', '质', '质', '质', '质', '质', '质', '色', '色', '色', '色', '色'], ['色']]
      },
      {one: '脉诊',
      two: ['脉位异常', '至数异常', '脉长异常', '脉宽异常', '脉力异常', '脉律异常', '流利度异常', '紧张度异常', '尺脉弱'],
      three: [['色', '脉浮', '脉沉', '脉伏'], ['脉牢', '脉数', '脉迟'], ['脉疾', '脉长'], ['脉短', '脉洪', '脉细', '脉濡', '脉弱'], ['脉微', '脉实'], ['脉虚', '脉促', '脉结'], ['脉代', '脉滑'], ['脉涩', '脉弦', '脉紧'], ['脉缓']]
      },
      {one:' 按诊',
      two: ['寒热', '肌肤', '润燥', '疼痛性质', '胸腹'],
      three: [['脉缓', '肢厥而身灼', '肢厥且身凉'], ['肢厥而身温', '皮肤弹性差/指端螺瘪', '皮肤粗厚硬肿', '结节或肿块'], ['肿块质硬不平'], ['皮肤干燥', '痛喜按或按之舒'], ['痛拒按或压痛甚', '脘腹部肿块', '小腹部肿块', '少腹部肿块', '腹内包块']]
      },
      {one: '高尿酸',
      two: ['胸腹'],
      three: [['乳房结块']]
      },
      {one: '子宫肌瘤',
      two: ['胸腹'],
      three: [['乳房结块']]
      },
      {one: '乳腺小叶增生',
      two: ['胸腹'],
      three: [['乳房结块']]
      },
      {one: '脂肪肝',
      two: ['胸腹'],
      three: [['乳房结块']]
      },
      {one: '高血脂',
      two: ['胸腹'],
      three: [['乳房结块']]
      },
      {one: '肥胖',
      two: ['胸腹'],
      three: [['乳房结块']]
      }
    ]
  },

  // 监听省市区选择的变更
  bindMultiPickerColumnChange: function(e) {
    let data = {
      multiArray: this.data.multiArray,
      multiIndex: this.data.multiIndex
    };
    // 更新用户选择的列
    data.multiIndex[e.detail.column] = e.detail.value;

    if (e.detail.column === 0) {
      // 改变第一级
      data.multiArray[1] = this.data.objectMultiArray[data.multiIndex[0]].two;
      data.multiArray[2] = this.data.objectMultiArray[data.multiIndex[0]].three[0];
      data.multiIndex[1] = 0;
      data.multiIndex[2] = 0;
    } else if (e.detail.column === 1) {
      // 改变第二级
      data.multiArray[2] = this.data.objectMultiArray[data.multiIndex[0]].three[data.multiIndex[1]];
      data.multiIndex[2] = 0; // 如果没有对应的第三级，确保选择第一个
    }

    // 打印调试信息
    console.log('更新后的 multiIndex:', data.multiIndex);
    console.log('更新后的 multiArray:', data.multiArray);

    // 更新页面数据
    this.setData(data);
},

 

 // 当选择完成时
 onPickerChange: function (e) {
  const multiIndex = e.detail.value;
  const selectedText = this.data.multiArray[2][multiIndex[2]]+'\n';
  
  this.setData({
    selectedItems: [...this.data.selectedItems, selectedText]
  });
  console.log(selectedItems)
},
 // 拍照并上传图片
 takePhoto() {
  const that = this;
  wx.chooseImage({
    count: 1,  // 限制只能选择一张图片
    sourceType: ['camera'],  // 只能通过相机拍照
    success(res) {
      const tempFilePaths = res.tempFilePaths;
      
      // 显示拍摄的图片
      that.setData({
        imageUrl: tempFilePaths[0]
      });
console.log(imageUrl)
      // 上传图片
      // wx.uploadFile({
      //   url: 'https://your-server-url/upload',  // 替换为实际的上传服务器接口
      //   filePath: tempFilePaths[0],
      //   name: 'file',
      //   formData: {
      //     'user': 'test'
      //   },
      //   success(uploadRes) {
      //     console.log('图片上传成功', uploadRes);
      //   },
      //   fail(uploadErr) {
      //     console.log('图片上传失败', uploadErr);
      //   }
      // });
    },
    fail(err) {
      console.log('拍照失败', err);
    }
  });
},
upload:function (params) {
  wx.navigateTo({
    url: '../login/login',
  })
}

});
